story.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Game Story</a>
<ul>
<li><a href="#sec-1-1">1.1. The Kal'whereever Conumdrum</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. A Dwarven Army Is Camped outside the city of Kal'Someplace.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

# Game Story<a id="sec-1" name="sec-1"></a>

## The Kal'whereever Conumdrum<a id="sec-1-1" name="sec-1-1"></a>

### A Dwarven Army Is Camped outside the city of Kal'Someplace.<a id="sec-1-1-1" name="sec-1-1-1"></a>

1.  A hundred years ago, the city fell.

    1.  The citizens of the city were beset by illusions that got worse over time.
    
    2.  Eventually the miners broke into ancient ruines deep in the heart of the city.
    
    3.  A terrible sound came from the ruins.
    
    4.  Everyone either died or fled.
    
        1.  NOTE: Presumably they fled in a hurry. If we can make it to the city, there might be phat loot.

2.  General Tavarium Steelhide hired mercenary groups to help overtake the city.

    1.  His battered breastplate bears a griffin, which is the coat of arms of his house.
    
        1.  The party found a crypt with tombs including his coat of arms.

3.  The party is tasked with finding a lost scouting group (30 men).

    1.  Scouts were looking for an entrance to the mines and were clearing out monsters.
    
    2.  The entrance of the catacombs was barricaded shut (?)from the outside(?).
    
        1.  This is somewhat suspicious. Did they seal their own party inside? If so, no wonder they are lost.
    
    3.  Upon entering the catacombs the party noticed the smell of food and the sound of music.
    
        1.  Following this (?)enchanted(?) most of the party members into a never ending illusionary feast.
        
        2.  An angelic looking being beams down from on high, visible to the still rational members of party.
        
            1.  Warns of a trickster demon that will do anything to be freed.
            
            2.  Refuses to help the party out of the illusionary feast unless they agree to stop the demon.
            
            3.  Agrees to grant wishes if this is done.
            
            4.  Disappears in a huge cloud of not-very-helpfulness.
        
        3.  The feast vanishes, and the party notices a large poll of chum
        
            1.  A coin is tossed in, which the chum grabs before it hits the surface
            
                1.  NOTE: Demon coin?
            
            2.  A hasty withdrawal is made
    
    4.  Party sends ground level a status update.
    
        1.  Ground level says get back to work.
    
    5.  No sign of the party has been found, goblins-come-captives didn't know they were here.
    
        1.  Said captives die in a 40 ft pit fall
    
    6.  An armory is found, appears to have been raided; only remaining items are locked down
    
        1.  Loot
        
            1.  1000 gp / 500 pp
            
            2.  Garnet
            
            3.  Apparently Magical Amulet
            
            4.  Apparently Magical Robe
            
            5.  Apparently Magical Robe
            
            6.  NOTE: Maybe the dwarves took this stuff, if they exist.
            
            7.  NOTE: We should try to identify the magical items before we set out. Some of us (mainly me) are quite squishy right now.
    
    7.  A giant pig is discovered, naved Gavok
    
        1.  Has a good aura, seems pretty chill
        
        2.  Says he is a king from some pla(ain/ne)s who was last seen 300 years ago.
        
            1.  NOTE: We should figure out if he meant the biome or Astral/Shadow/Whatever.
        
        3.  He isn't sure it was 300 years ago.
        
        4.  Doesn't appear to sleep.
        
        5.  Claims they made him a big pig so he wouldn't escape, was more docile.
        
            1.  NOTE: Pigs go feral really fuckin' fast.
        
        6.  It sounds like they wanted his blood.
    
    8.  A second report is made to ground level.
    
        1.  Ground level says they'll look into piggy's history, get back to work.
    
    9.  A group of goblins are found eating in a hall next to the (now freed) pig's room.
    
        1.  They are unarmed and taken by surprise; easily dealt with.
        
            1.  NOTE: Any indication that their gear was the stuff missing from the armory?
            
            2.  NOTE: Were they eating bacon? If piggy is so old, maybe he is able to heal magically and they were harvesting him.
        
        2.  The goblin dinning hall is secured, the group rests.